// برنامه ای بنویسید که سن کاربر را دریافت کند و بررسی کند ایا ورودی صحیح است یا خیر سپس با alert به کاربر نشان دهد.
// let age = prompt ('enter your age')
// let age=20

// if (age>=20) {
//     console.log("ورودی معتبر است");
    
// }else(age>=20) 
//     console.log(" نامعتبر است");




let age= prompt('لطفا سن خود را وارد کنید');

if (age === null || age.trim() === "" ) {

    alert("ورودی خالی است لطفا سن را وارد کنید");

}else if (Number(age)===20) {

    alert("سن شما 20 است.ورودی صحیح است");
        
    }else{
        alert("ورودی عدد است اما عدد وارد شده 20 نیست");
    }


    
    




    



  


  
     

